# FinalHomeWork
# Заданные условия:

Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

# Описание решения:

Решение данной задачи написано на языке С# c использование программы Visual Studio Code.

1. Определяем массив строк
```
string[] array;
```
2. Просим пользователя ввести массив строки 

```
Console.WriteLine("Введите массив строк через пробел:");
```
3. Считывае введенную пользователем строку
```
string? stroka = Console.ReadLine();
```

4. После введения пользователем строки, программа считывает строку, формируя из нее массив и с помощью системного метода String.Split  разбивает строку на подстроку с разделителем "пробел" ( если символы-разделители не указаны, строка разбивается по символам пробела)

```
array = stroka!.Split(' ');
```
5. Для вывода массива строк, длина которых меньше либо равна 3 символа создаем метод ArrayLines с невозвращаемым значением "void".

```
void ArrayLines(string[] array) 
{ 
    далее код
}
```
6. Код метода ArrayLines:

Для данного метода мы используем цикл for и оператор if
```
void ArrayLines(string[] array) 
{ 
   for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            Console.Write($"{array[i]} ");
        }
    }
}
```
Таким образом, мы проходим цикл от индекса равного 0 до индекса, который меньше размера массива (путем увеличения i при каждой итерации), при этом соблюдаем условие оператора if и записываем элементы массивы, размер которых меньше либо равен 3 символам, если данное условие не соблюдено (элемент массива содержит более 3 символов) тогда программа не записывает данный элемент.

7. Вызываем метод ArrayLines

```
ArrayLines(array);
```
8. Результат- программа выдает массив строк, длина которых меньше либо равна 3 символа из имеющегося массива строк, введенного пользователем.
